package lesson2.main;



public class HW11 {

//6. Составьте программу, выводящую на экран квадраты чисел от 10 до
//20 включительно.

    public static void main(String[] args) {
        for (int i = 10; i <= 20 ; i++) {
            System.out.print(i*i + " ");
        }
    }
}
